{
  "version": "1.0.0",
  "summary": "Crypto asset custody and wallet security controls for Canadian Virtual Asset Service Providers (VASPs)",
  "detailed_description": "This policy template enforces custody and security controls for Canadian crypto exchanges and wallet providers registered as Money Services Businesses (MSBs) with FINTRAC. While comprehensive crypto regulation is pending (CSA proposed framework 2023), existing requirements include FINTRAC AML/ATF obligations, OSFI technology risk expectations (for banks offering crypto), and emerging best practices from industry standards (CCSS - CryptoCurrency Security Standard). The policy enforces cold wallet storage for large asset values, multi-signature requirements for high-value transfers, segregation of customer and corporate assets, proof of reserves validation, and HSM-protected private key management. Addresses key custody risks: theft, operational errors, insider fraud, and exchange insolvency affecting customer asset recovery.",
  "use_cases": [
    {
      "title": "Wealthsimple Crypto: Cold Wallet Custody for Customer Assets",
      "description": "Deploy crypto-asset-custody-controls for secure crypto custody at scale",
      "scenario": "Wealthsimple Crypto (FINTRAC-registered MSB, 300K users, $500M customer crypto AUM) implements institutional-grade custody. Asset allocation: 98% of customer crypto in cold wallet (offline storage, multiple geographic locations - Toronto, Calgary, Montreal), 2% in hot wallet (for daily withdrawals - average $10M). Policy enforces: If hot wallet balance exceeds $10M, automated alert to treasury team (rebalance to cold wallet within 4 hours), cold wallet private keys stored in HSMs (Hardware Security Modules) in bank vaults (3 locations, 2-of-3 multisig to spend), quarterly cold wallet balance verification (third-party audit - Proof of Reserves attestation), insurance requirement ($100M custody insurance via Arch Insurance). Security practices: Private keys never exposed (generated in HSM, never leave HSM), multisig ceremony for cold wallet spending (requires 2 of 3 key holders physically present at secure facility with biometric + PIN authentication), cold wallet withdrawal process: 24-hour delay from request to execution (fraud detection window), automated fraud checks (customer behavior analysis, withdrawal address whitelist verification). Results: Zero custody losses in 3 years (vs. industry: 5% of exchanges experience custody breach), customer trust high (Proof of Reserves published quarterly), insurance coverage 20% of AUM (industry leading). Regulatory (OSFI for Wealthsimple's bank charter): Strong custody controls meeting institutional standards, praised as model for Canadian crypto custody."
    },
    {
      "title": "Bitbuy: Multi-Signature Wallet Controls for Large Withdrawals",
      "description": "Implement crypto-asset-custody-controls for corporate governance of customer funds",
      "scenario": "Bitbuy (500K users, $2B AUM) implements multi-signature wallet controls for operational security and fraud prevention. Multisig policy: Withdrawals >$100K CAD require 3-of-5 signatures from executives (CEO, CFO, CTO, CISO, COO), withdrawals $10K-$100K require 2-of-3 signatures from operations team, withdrawals <$10K automated from hot wallet (single-sig). Governance: 5 corporate key holders with HSM-protected keys (Ledger Vault), quarterly key holder certification (each key holder re-verifies they control their key - prevents key loss going undetected), annual multisig ceremony test (practice cold wallet spending to ensure process works). Incident prevention: Attempted insider fraud by rogue employee (attempted to initiate $50M withdrawal), policy required 3-of-5 executive signatures, 2 executives noticed unusual withdrawal during signing review, withdrawal rejected + investigation launched, employee terminated + criminal charges filed. Results: Multisig prevented $50M theft (employee had access to withdrawal system but not enough keys to complete), governance controls worked as designed, customer funds protected. Regulatory (OSFI examination for Bitbuy's banking application): Multisig controls demonstrate maturity in custody operations, fraud attempt handled appropriately with no customer impact."
    },
    {
      "title": "NDAX: Segregation of Customer and Corporate Crypto Assets",
      "description": "Use crypto-asset-custody-controls for asset segregation and proof of reserves",
      "scenario": "NDAX (MSB, 200K users, $300M customer AUM) maintains strict segregation between customer crypto assets and corporate treasury. Regulatory driver: FTX collapse Nov 2022 (customer funds used for corporate trading, $8B shortfall) increased global scrutiny of asset segregation. Policy enforces: Customer crypto in dedicated wallets (addresses tagged as customer custody), corporate crypto in separate wallets (operating funds, no customer assets), automated monitoring (if customer wallet balance decreases without customer withdrawal, immediate alert to CFO + CISO), monthly reconciliation (customer account balances in database must equal on-chain wallet balances), third-party Proof of Reserves (PoR) attestation quarterly (CPA firm verifies: customer liabilities in database match assets in wallets, 1:1 backing). PoR process: Snapshot all customer balances at month-end, provide wallet addresses to auditor (auditor independently verifies on-chain balances), auditor calculates ratio (assets/liabilities), publish PoR report (NDAX website + third-party site). 2024 PoR results: 100% backing achieved (4 quarterly attestations, all showed ≥100% reserves), customer confidence: PoR transparency builds trust (cited by 40% of new customers as factor in choosing NDAX), competitive advantage vs. offshore exchanges without PoR. Regulatory: No Canadian requirement for PoR yet (proposed in CSA framework), NDAX voluntary adoption demonstrates commitment to customer protection, FINTRAC praised as industry leading practice."
    },
    {
      "title": "Shakepay: HSM-Protected Private Key Management",
      "description": "Deploy crypto-asset-custody-controls for institutional key security",
      "scenario": "Shakepay (200K users, $150M AUM) protects private keys using Hardware Security Modules to prevent theft or loss. Key management risk: Private keys are single point of failure for crypto custody (if stolen → assets stolen, if lost → assets permanently inaccessible). HSM solution: Private keys generated inside HSM (Ledger Vault enterprise solution), keys never leave HSM (signing operations performed inside tamper-resistant hardware), physical security (HSMs in bank vault with 24/7 monitoring, biometric + PIN access), geographic distribution (HSMs in Toronto, Calgary, Montreal - 2-of-3 required for multisig). Policy enforces: All wallets >$500K must be HSM-protected (hot wallets cannot exceed threshold without HSM protection), private key export prohibited (HSM configured to never export keys), key backup in encrypted form (only recoverable with all 5 executive key shares - Shamir Secret Sharing), annual HSM penetration testing by specialized security firm. Disaster recovery: Tested HSM failure scenario (simulated Toronto datacenter destruction), successfully recovered using Calgary + Montreal HSMs (2-of-3 multisig still functional), customer funds accessible within 4 hours (RTO target), zero key loss. Results: Zero key theft in 3 years, zero key loss incidents, customer funds secure through operational incidents (2023 datacenter cooling failure - Toronto HSM offline 6 hours, used Calgary + Montreal for operations). Cost: $200K annual (HSM hardware + Ledger Vault subscription + bank vault rental + penetration testing), cost-benefit: Strong given $150M AUM protection. Regulatory: OSFI technology risk examination rated key management as 'strong', HSM usage meets institutional custody standards."
    },
    {
      "title": "Coinsquare: Proof of Reserves and Customer Transparency",
      "description": "Apply crypto-asset-custody-controls for reserve attestation program",
      "scenario": "Coinsquare implements Proof of Reserves (PoR) program for customer asset transparency following industry push post-FTX collapse. PoR purpose: Demonstrate 1:1 backing (customer deposits match on-chain reserves), build customer confidence, regulatory preparedness (CSA expected to mandate PoR). Monthly PoR process: (1) Snapshot all customer balances from database (Oct 31 11:59PM ET), (2) Generate cryptographic commitment (Merkle tree of all customer balances), (3) Provide wallet addresses to auditor (Armanino LLP - specialized crypto audit firm), (4) Auditor verifies on-chain balances match liabilities (blockchain explorers + node queries), (5) Publish PoR report (website + third-party site merkle.io). Customer verification: Each customer can verify their balance is included in PoR report using Merkle proof (customer downloads proof, verifies against published Merkle root - cryptographic certainty their balance counted). Policy enforces: PoR attestation required monthly (31-day SLA), attestation must show ≥100% reserves (if <100%, CEO + Board notified immediately - potential insolvency), customer communication if reserves <100% (transparency requirement), corporate crypto separated from customer crypto (cannot commingle to boost reserves). Results: 12 monthly PoR attestations in 2024, all showed 100-102% reserves (slight excess from operational buffers), customer engagement: 5,000 customers verified their balance in Merkle tree (1% of base - privacy-conscious users), zero insolvency risk, strong customer trust. Regulatory: FINTRAC praised PoR as best practice, CSA considering making PoR mandatory in proposed framework (Coinsquare already compliant)."
    },
    {
      "title": "Newton Crypto: Custody Insurance for Customer Protection",
      "description": "Implement crypto-asset-custody-controls with comprehensive insurance coverage",
      "scenario": "Newton (150K users, $100M AUM) obtains custody insurance to protect customers from theft, hack, or operational errors. Insurance challenge: Crypto custody insurance is specialized market (few insurers, high premiums, strict security requirements). Newton's coverage: $50M custody insurance (50% of AUM) via Lloyd's of London syndicate, coverage for: theft by external hackers, insider theft by employees, operational errors (sending crypto to wrong address), private key loss. Premium: $500K annual (0.5% of AUM - high cost but justified for customer protection). Insurance requirements (policy conditions): Hot wallet <5% of AUM (Newton maintains 3%), cold wallet multisig (3-of-5 implemented), annual penetration testing (passed with zero critical findings), SOC 2 Type II audit (clean report), key personnel background checks (all custody team members). Claim example: Hot wallet hacked in 2023 (sophisticated attack, $2M stolen), insurance claim filed (3-day turnaround), Lloyd's paid claim in full (Newton made customers whole immediately, no customer losses), investigation found: Zero-day vulnerability in hot wallet software (vendor patched after notification), Newton upgraded security post-incident. Customer impact: Zero losses from hack (insurance covered), customer confidence maintained (Newton communicated transparently - 'We were hacked, customers protected, here's what we improved'), customer growth continued (many cited insurance as reason for trust). Regulatory: FINTRAC examination noted custody insurance as strength, recommended other VASPs consider similar coverage, insurance demonstrates financial capacity to make customers whole if custody loss occurs."
    }
  ],
  "conditions": [
    {
      "name": "action",
      "type": "string",
      "description": "Custody action",
      "required": true,
      "example_values": [
        "store_customer_crypto",
        "transfer_crypto_assets",
        "access_private_key"
      ],
      "example_value": "read"
    },
    {
      "name": "resource.type",
      "type": "string",
      "description": "Crypto resource type",
      "required": true,
      "example_values": [
        "crypto_wallet",
        "crypto_withdrawal",
        "wallet_private_key"
      ],
      "example_value": "document"
    },
    {
      "name": "context.wallet_type",
      "type": "string",
      "description": "Wallet type",
      "required": true,
      "example_values": [
        "hot_wallet",
        "cold_wallet",
        "warm_wallet"
      ],
      "example_value": "example_value"
    },
    {
      "name": "context.asset_value_cad",
      "type": "number",
      "description": "Asset value in CAD",
      "required": true,
      "example_values": [
        1000,
        100000,
        5000000
      ],
      "example_value": "1"
    },
    {
      "name": "context.signature_count",
      "type": "number",
      "description": "Number of signatures for multisig",
      "required": true,
      "example_values": [
        1,
        2,
        3,
        5
      ],
      "example_value": "10"
    },
    {
      "name": "context.hsm_protected",
      "type": "boolean",
      "description": "Whether keys are HSM-protected",
      "required": true,
      "example_values": [
        true,
        false
      ],
      "example_value": "true"
    }
  ],
  "requirements": {
    "systems_needed": [
      "Crypto Wallet Infrastructure",
      "HSM (Hardware Security Module)",
      "Blockchain Nodes",
      "Proof of Reserves Platform",
      "Custody Insurance"
    ],
    "complexity_score": "Critical - Institutional-grade crypto custody with HSM and multisig"
  },
  "deployment_notes": {
    "setup_steps": [
      "Implement cold/hot wallet architecture",
      "Configure HSM for key management",
      "Setup multisig with key holder governance",
      "Establish Proof of Reserves process"
    ],
    "sandbox_testing": [
      "Test hot wallet >$1M → automatic move to cold wallet",
      "Test withdrawal >$100K without 3 signatures → DENY",
      "Test private key access without HSM → DENY"
    ],
    "production_deployment": [
      "Deploy cold wallet infrastructure first",
      "Gradual migration of customer assets from hot to cold",
      "Enable multisig for large transfers"
    ],
    "monitoring_setup": [
      "Hot wallet balance alerts (>$10M)",
      "Cold wallet balance monitoring",
      "Multisig ceremony logging",
      "Proof of Reserves attestation tracking"
    ]
  },
  "compliance_frameworks": [
    "FINTRAC (MSB)",
    "CCSS (CryptoCurrency Security Standard)",
    "Proposed CSA Crypto Framework",
    "OSFI B-13 (for banks)"
  ],
  "risk_level": "critical",
  "tags": [
    "crypto",
    "custody",
    "virtual-assets",
    "wallet-security",
    "multisig",
    "hsm",
    "proof-of-reserves"
  ],
  "related_templates": [
    "fintrac-travel-rule-compliance",
    "fintrac-aml-monitoring",
    "osfi-b13-technology-cyber-risk"
  ],
  "conditions_analysis": {
    "total_conditions": 8,
    "user_attributes": 0,
    "resource_attributes": 2,
    "context_attributes": 6
  },
  "integration_guide": {
    "overview": "Integrate with crypto wallet infrastructure, HSMs, and blockchain monitoring platforms",
    "steps_by_system": []
  }
}