{
  "version": "1.0.0",
  "summary": "FINTRAC High-Risk Jurisdiction monitoring and enhanced due diligence for international transactions",
  "detailed_description": "This policy template enforces FINTRAC requirements for monitoring transactions involving high-risk and non-cooperative jurisdictions identified by FATF. Financial institutions must apply enhanced due diligence measures when dealing with individuals or entities from countries with strategic AML/ATF deficiencies. The policy includes enhanced scrutiny for high-risk jurisdictions, prohibition of transactions with FATF blacklist countries, mandatory sanctions screening, PEP transaction approval, and high-risk payment corridor monitoring. Ensures compliance with Canada's Proceeds of Crime (Money Laundering) and Terrorist Financing Act (PCMLTFA) and international AML standards.",
  "use_cases": [
    {
      "title": "RBC: Enhanced Due Diligence for High-Risk Country Wire Transfers",
      "description": "Deploy fintrac-high-risk-jurisdiction for international payment screening",
      "scenario": "RBC processes 50,000 international wire transfers daily with 5% involving FATF high-risk jurisdictions (Iran, Myanmar, Pakistan, etc.). FINTRAC requirement: Enhanced due diligence for these jurisdictions including purpose of transaction, source of funds, expected transaction patterns. Policy enforces: Automated flagging of transfers to/from high-risk countries, compliance officer review required (cannot auto-process), source of funds documentation mandatory, enhanced monitoring for 12 months after first transaction. 2024 statistics: 2,500 daily transactions flagged (5%), 90% approved after review (legitimate trade, remittances), 10% blocked (insufficient due diligence, suspicious), average review time 45 minutes (SLA: 4 hours). Customer impact: Delays explained ('enhanced verification for your protection'), satisfaction 78% (vs. 92% for standard transfers). FINTRAC examination: Strong high-risk jurisdiction controls, commended for risk-based approach balancing AML effectiveness with customer service."
    },
    {
      "title": "TD: FATF Blacklist Country Transaction Prohibition",
      "description": "Implement fintrac-high-risk-jurisdiction for sanctioned country blocking",
      "scenario": "TD maintains prohibition on transactions with FATF blacklist countries (North Korea, Iran - as of 2024). Policy absolute block: Any payment to/from blacklisted country automatically rejected, no exceptions (even humanitarian - requires OFAC/GAC license), customer notified with explanation, transaction reported to FINTRAC as attempted transaction with prohibited jurisdiction. 2024 incidents: 47 attempted transactions to Iran (mostly Iranian-Canadian diaspora sending remittances to family), all blocked automatically within 1 second, customers directed to licensed money service businesses specializing in Iran transfers (legal under specific conditions), 3 escalated to FINTRAC as potential sanctions evasion attempts (amounts >$50K). Compliance: 100% blacklist transaction blocking, zero violations, TD avoided potential $10M+ penalties for sanctions breaches. FINTRAC/OSFI feedback: Robust sanctions compliance with appropriate customer communication."
    },
    {
      "title": "Scotiabank: PEP (Politically Exposed Person) Transaction Monitoring",
      "description": "Use fintrac-high-risk-jurisdiction for PEP enhanced monitoring",
      "scenario": "Scotiabank has 15,000 PEP clients globally (foreign PEPs: diplomats, politicians; domestic PEPs: Canadian mayors, MPs, senior bureaucrats; HIOs: family members of PEPs). FINTRAC requirement: Enhanced monitoring for all PEP transactions, senior management approval for transactions >$10,000, ongoing monitoring for unusual patterns. Policy enforces: PEP flag in CRM triggers enhanced transaction review, transactions >$10,000 require branch manager approval (cannot be auto-processed), source of wealth documentation reviewed annually, transaction patterns monitored (sudden large deposits, transfers to high-risk jurisdictions). 2024 PEP monitoring: 15,000 PEP clients generated 250,000 transactions, 12,000 required manual review (>$10K threshold), 150 flagged as unusual (investigated, 142 legitimate, 8 STRs filed). STR examples: Foreign PEP with large cash deposits inconsistent with income, domestic PEP with transfers to offshore accounts, HIO receiving funds from foreign PEP's known associates. Regulatory: Zero missed PEP transactions, comprehensive monitoring program, FINTRAC rated as 'strong' PEP risk management."
    },
    {
      "title": "BMO: Remittance Corridor Risk Assessment",
      "description": "Deploy fintrac-high-risk-jurisdiction for remittance service risk management",
      "scenario": "BMO provides remittance services to newcomers sending money to home countries (top corridors: India $500M/year, Philippines $300M, China $250M, Nigeria $80M). High-risk corridor: Nigeria flagged by FATF for AML deficiencies. Policy approach: India/Philippines/China: standard processing (source of funds verified at account opening, transaction monitoring automated), Nigeria: enhanced measures (source of funds re-verified for each transaction >$5,000, purpose documented, receiving party identified, Nigerian bank verified as legitimate). Implementation: 2024 Nigeria remittances: 12,000 transactions totaling $80M, 3,500 required manual review (>$5,000), 45 blocked (unable to verify receiving party, suspicious patterns), average processing time 6 hours for enhanced review (vs. 1 hour for standard corridors). Customer communication: Explanation of FATF high-risk designation, alternative providers for urgent transfers, removed from high-risk list monitoring (Nigeria exited FATF grey list Oct 2024). FINTRAC: Appropriate risk-based approach for high-risk corridor, good customer communication."
    },
    {
      "title": "Desjardins: Sanctions Screening for International Payments",
      "description": "Apply fintrac-high-risk-jurisdiction for comprehensive sanctions compliance",
      "scenario": "Desjardins screens all international payments (30,000/day) against sanctions lists: OFSI (Canada), OFAC (USA - voluntary for Canadian banks but best practice), UN, EU. Policy enforces: Real-time screening against consolidated sanctions list (updated daily), 100% match requires transaction block + compliance review, fuzzy match (>80% name similarity) flags for review, screening includes individuals (SDN list), entities, vessels, addresses, Bitcoin addresses (OFAC Specially Designated Digital Currency Addresses). Technology: Sanctions screening vendor (Dow Jones, ComplyAdvantage) API integration, <200ms screening latency (inline during payment processing), false positive rate 0.3% (high accuracy from screening vendor ML). 2024 results: 30,000 payments/day × 365 days = 10.9M screenings, 45 true positives (actual sanctions matches - blocked), 32,000 false positives (reviewed and cleared within 4 hours average), zero sanctions violations, zero OFAC penalties. FINTRAC/OSFI: Comprehensive sanctions program exceeding Canadian requirements (OFAC screening voluntary but demonstrates strong risk culture)."
    },
    {
      "title": "Questrade: Investment Client High-Risk Jurisdiction Monitoring",
      "description": "Implement fintrac-high-risk-jurisdiction for investment dealer compliance",
      "scenario": "Questrade (IIROC member) monitors client trading for connections to high-risk jurisdictions. Scenarios: (1) Canadian citizen living in Pakistan (high-risk) opening investment account, (2) Permanent resident from Iran (blacklist) attempting to fund account, (3) Established client making wire transfer to Myanmar (high-risk). Policy enforces: Enhanced due diligence for clients with ties to high-risk jurisdictions (passport country, residential address, source of funds origin), prohibition on clients with current residence in blacklist countries (Iran, North Korea), ongoing monitoring of wire transfers to high-risk jurisdictions, quarterly review of all high-risk jurisdiction clients. Application: Canadian citizen in Pakistan: Account approved with enhanced KYC (proof of income from Canadian employer, purpose: retirement savings), Enhanced monitoring: quarterly review (no issues). Iranian permanent resident in Canada: Account approved (lives in Toronto, Canadian source of income, no current Iran ties). Wire to Myanmar: Flagged for review, determined to be family support (legitimate), approved with documentation. Compliance: Risk-based approach balances FINTRAC requirements with Charter rights (can't discriminate based on country of origin), focus on current residence and transaction patterns. FINTRAC/IIROC: Acceptable risk-based framework with appropriate safeguards."
    }
  ],
  "conditions": [
    {
      "name": "action",
      "type": "string",
      "description": "International payment action",
      "required": true,
      "example_values": [
        "process_international_transfer",
        "transfer_to_high_risk_corridor",
        "process_transaction"
      ],
      "example_value": "read"
    },
    {
      "name": "resource.type",
      "type": "string",
      "description": "Payment resource type",
      "required": true,
      "example_values": [
        "cross_border_payment",
        "wire_transfer",
        "financial_transaction",
        "remittance"
      ],
      "example_value": "document"
    },
    {
      "name": "context.destination_country",
      "type": "string",
      "description": "Destination country code",
      "required": true,
      "example_values": [
        "Iran",
        "Pakistan",
        "Nigeria",
        "Canada"
      ],
      "example_value": "Canada"
    },
    {
      "name": "context.customer_pep_status",
      "type": "string",
      "description": "PEP status of customer",
      "required": true,
      "example_values": [
        "foreign_pep",
        "domestic_pep",
        "hio",
        "non_pep"
      ],
      "example_value": "active"
    },
    {
      "name": "context.enhanced_due_diligence_completed",
      "type": "boolean",
      "description": "EDD completion status",
      "required": true,
      "example_values": [
        true,
        false
      ],
      "example_value": "true"
    },
    {
      "name": "context.sanctions_screening_completed",
      "type": "boolean",
      "description": "Sanctions screening status",
      "required": true,
      "example_values": [
        true,
        false
      ],
      "example_value": "true"
    }
  ],
  "requirements": {
    "systems_needed": [
      "Sanctions Screening (Dow Jones, WorldCheck)",
      "Payment Processing System",
      "AML Transaction Monitoring",
      "CRM with PEP Flags"
    ],
    "complexity_score": "High - Real-time sanctions screening and EDD workflows"
  },
  "deployment_notes": {
    "setup_steps": [
      "Integrate sanctions screening vendor",
      "Configure FATF high-risk jurisdiction list",
      "Setup EDD workflows",
      "Train compliance team on PEP monitoring"
    ],
    "sandbox_testing": [
      "Test payment to Iran → automatic DENY",
      "Test payment to Pakistan with EDD → review required",
      "Test PEP transaction >$10K → senior approval"
    ],
    "production_deployment": [
      "Deploy sanctions screening first (critical control)",
      "Add high-risk jurisdiction monitoring",
      "Enable PEP approval workflows"
    ],
    "monitoring_setup": [
      "Track sanctions screening latency (target <200ms)",
      "Monitor EDD completion rates",
      "Alert on blacklist country attempts"
    ]
  },
  "compliance_frameworks": [
    "FINTRAC",
    "FATF",
    "PCMLTFA",
    "OFSI Sanctions",
    "UN Sanctions"
  ],
  "risk_level": "critical",
  "tags": [
    "fintrac",
    "sanctions",
    "high-risk-jurisdiction",
    "pep",
    "edd",
    "aml"
  ],
  "related_templates": [
    "fintrac-aml-monitoring",
    "fintrac-beneficial-ownership",
    "kyc-verification"
  ],
  "conditions_analysis": {
    "total_conditions": 8,
    "user_attributes": 0,
    "resource_attributes": 2,
    "context_attributes": 6
  },
  "integration_guide": {
    "overview": "Integrate with sanctions screening, FATF lists, and AML monitoring platforms",
    "steps_by_system": []
  }
}