{
  "version": "1.0.0",
  "summary": "FSRA Ontario consumer protection and fair treatment requirements for insurance and financial services",
  "detailed_description": "This policy template enforces Financial Services Regulatory Authority of Ontario (FSRA) consumer protection requirements for insurance companies, pension plans, credit unions, and mortgage brokers operating in Ontario. FSRA's mandate includes protecting consumer rights, ensuring fair treatment, requiring transparent disclosures, and mandating timely complaint resolution. The policy enforces prohibition of unfair pricing practices, 30-day complaint handling requirements, risk disclosure for complex products, and enhanced suitability assessments for vulnerable customers. Supports compliance with Ontario's Insurance Act, Credit Unions and Caisses Populaires Act, and Mortgage Brokerages Act.",
  "use_cases": [
    {
      "title": "Manulife: Insurance Product Fair Pricing Compliance",
      "description": "Deploy fsra-ontario-consumer-protection for life insurance pricing oversight",
      "scenario": "Manulife offers life insurance in Ontario (3M policies). FSRA fair treatment review: (1) Pricing not discriminatory on prohibited grounds (age/gender allowed for actuarial soundness, race/religion prohibited), (2) Similar risk = similar price, (3) Transparent pricing methodology. Policy enforces: Automated detection if pricing algorithm uses prohibited factors, requiring actuarial justification for all pricing differences, disclosure of pricing factors to consumers, annual pricing fairness audit by appointed actuary. 2024 pricing review found: Gender-based pricing acceptable (actuarially justified mortality differences), postal code pricing raised concern (correlation with income/race - required justification: actual loss experience by region, not demographic proxy). FSRA examination: Pricing methodology acceptable, recommended enhanced documentation of actuarial basis. Customer complaints: 45 pricing discrimination complaints (all investigated, found actuarially justified, explained to customers)."
    },
    {
      "title": "Sun Life: Complex Product Disclosure for Segregated Funds",
      "description": "Implement fsra-ontario-consumer-protection for investment product transparency",
      "scenario": "Sun Life sells segregated fund contracts (insurance wrapper for mutual funds) to Ontario customers. Product complexity: Investment risk + insurance guarantees + higher fees than mutual funds. FSRA disclosure requirements: Clear explanation of guarantees, fee disclosure, comparison to alternatives, suitability assessment. Policy enforces: Risk disclosure document must be provided before sale, customer acknowledgment required (digital signature), fee comparison to equivalent mutual fund shown, suitability questionnaire completed (risk tolerance, investment objectives, time horizon), enhanced disclosure for seniors 65+ (vulnerable customer protection). Compliance: 100% of sales have completed disclosure (tracked in CRM), 12% of applications abandoned after fee disclosure (informed decision-making working), zero FSRA complaints on inadequate disclosure in 2024 (vs. 15 in 2023 before policy implementation). FSRA examination: Strong disclosure practices protecting Ontario consumers, model for other insurers."
    },
    {
      "title": "Meridian Credit Union: Complaint Handling for FSRA Compliance",
      "description": "Use fsra-ontario-consumer-protection for regulatory complaint management",
      "scenario": "Meridian (370K members) must resolve complaints within 30 business days per FSRA rule. Complaint types: Fee disputes, service quality, product suitability, privacy concerns. Policy enforces: Complaints logged in tracking system on Day 0, automated workflow assignment, escalation if unresolved by Day 25 (5-day buffer before FSRA deadline), senior management review for complex complaints, member communication every 10 days (progress updates), written resolution within 30 days. 2024 complaints: 1,200 complaints (0.32% of members), 92% resolved within 30 days (target: 95%), 8% extended with member consent for complex investigations (fraud, legal issues), average resolution time 18 days, member satisfaction with resolution process 78%. FSRA reporting: Quarterly complaint statistics submitted, complaint handling procedures reviewed in 2024 examination, rated as satisfactory. Improvements from policy enforcement: Automated tracking eliminated missed deadlines (previous: 5% >30 days), member communication improved (previous: 40% complained about no updates), resolution quality increased (member satisfaction up from 65%)."
    },
    {
      "title": "Manulife: Vulnerable Customer Protection for Seniors",
      "description": "Deploy fsra-ontario-consumer-protection for vulnerable customer safeguards",
      "scenario": "Manulife implements enhanced protections for vulnerable customers (seniors 75+, cognitive impairment, financial difficulty) selling insurance and annuities in Ontario. FSRA expectation: Firms must identify vulnerability indicators and apply appropriate safeguards. Policy enforces: Enhanced suitability assessment for customers flagged as vulnerable (additional questions on financial situation, dependency on investment, understanding of product risks), call recording for all vulnerable customer sales (quality assurance review), cooling-off period explanation (10-day free look for Ontario policies), trusted contact person option offered (family member can be notified of suspicious activity). Implementation: Vulnerability flags in CRM (age 75+, prior complaint about product understanding, financial hardship disclosed), advisor training on vulnerable customer interactions (empathy, plain language, no pressure), compliance monitoring (sample 10% of vulnerable customer sales for quality review). Results: Vulnerable customer population 18% of Ontario customer base, 100% receive enhanced suitability assessment, 3 sales reversed during free look period (customers didn't understand product - good outcome), zero FSRA complaints from vulnerable customers in 2024 (vs. 8 in 2023). FSRA feedback: Leading practice for vulnerable customer protection, regulatory guidance cites Manulife's approach."
    },
    {
      "title": "Desjardins: Cross-Border Challenge - Quebec vs Ontario Requirements",
      "description": "Apply fsra-ontario-consumer-protection alongside AMF Quebec requirements",
      "scenario": "Desjardins operates in Quebec (primary) and Ontario (smaller presence). Regulatory complexity: AMF Quebec rules differ from FSRA Ontario (language requirements, complaint handling timelines, product approval). Policy approach: Jurisdiction-aware controls - Quebec customers → AMF requirements (French language primary, 30-day complaint resolution, AMF product registration), Ontario customers → FSRA requirements (English/French available, 30-day complaint resolution, FSRA product approval). Implementation: CRM tags customer jurisdiction by address, complaint handling system routes to appropriate workflow (AMF or FSRA), product catalog flags which products approved in which provinces, advisor training on provincial differences. Challenge example: Customer moves from Quebec to Ontario mid-policy - policy enforces Ontario requirements upon address change, product suitability re-evaluated if Ontario rules stricter, customer notified of regulatory change. Compliance: 100% adherence to provincial requirements, zero cross-jurisdiction violations, efficient operations despite dual regulatory framework. AMF + FSRA examinations: Strong provincial compliance management, appropriate use of technology to manage regulatory complexity."
    },
    {
      "title": "Co-operators Insurance: FSRA Guidance on AI in Underwriting",
      "description": "Implement fsra-ontario-consumer-protection for AI/ML insurance underwriting",
      "scenario": "Co-operators deploys AI-powered auto insurance underwriting in Ontario. FSRA emerging guidance on AI: (1) Explainability of AI decisions (especially denials), (2) Prohibition of bias/discrimination, (3) Human oversight for adverse decisions, (4) Consumer right to explanation. Policy enforces: AI underwriting decisions must include explanation (top 3 factors influencing premium: driving record, location, vehicle), human underwriter review required for AI denials or rates >150% of standard, bias testing quarterly (protected classes: age, gender, race proxies like postal code), consumer can request human re-review of AI decision (exercised by 50 customers in 2024, 5 decisions revised). Results: AI underwriting 95% of applications (5% require human due to complexity), explainability feature increased trust (NPS +12 points), bias audits found zero discrimination (pricing correlated with loss experience only), FSRA examination: Acceptable AI use with strong governance, transparency, and fairness controls, Ontario Superintendent praised Co-operators as model for AI insurance implementation."
    }
  ],
  "conditions": [
    {
      "name": "action",
      "type": "string",
      "description": "Consumer protection action",
      "required": true,
      "example_values": [
        "offer_financial_product",
        "receive_customer_complaint",
        "sell_investment_product"
      ],
      "example_value": "read"
    },
    {
      "name": "resource.type",
      "type": "string",
      "description": "Product/service type",
      "required": true,
      "example_values": [
        "insurance_policy",
        "consumer_complaint",
        "insurance_investment"
      ],
      "example_value": "document"
    },
    {
      "name": "context.pricing_discriminatory",
      "type": "boolean",
      "description": "Whether pricing is discriminatory on prohibited grounds",
      "required": true,
      "example_values": [
        true,
        false
      ],
      "example_value": "true"
    },
    {
      "name": "context.complaint_resolved",
      "type": "boolean",
      "description": "Complaint resolution status",
      "required": true,
      "example_values": [
        true,
        false
      ],
      "example_value": "true"
    },
    {
      "name": "context.customer_vulnerability_flag",
      "type": "boolean",
      "description": "Customer identified as vulnerable",
      "required": true,
      "example_values": [
        true,
        false
      ],
      "example_value": "true"
    }
  ],
  "requirements": {
    "systems_needed": [
      "Insurance Policy Admin System",
      "CRM with Complaint Tracking",
      "Product Catalog",
      "Pricing Engine"
    ],
    "complexity_score": "Medium - Consumer protection workflows with regulatory tracking"
  },
  "deployment_notes": {
    "setup_steps": [
      "Review FSRA consumer protection requirements",
      "Configure complaint tracking system",
      "Implement vulnerability detection",
      "Setup disclosure requirements"
    ],
    "sandbox_testing": [
      "Test product sale without disclosure → DENY",
      "Test complaint >30 days unresolved → ESCALATE",
      "Test vulnerable customer without enhanced assessment → DENY"
    ],
    "production_deployment": [
      "Deploy complaint handling first",
      "Add product disclosure controls",
      "Enable vulnerable customer protection"
    ],
    "monitoring_setup": [
      "Track complaint resolution times (target <30 days)",
      "Monitor disclosure completion rates",
      "Alert on vulnerable customer sales for quality review"
    ]
  },
  "compliance_frameworks": [
    "FSRA",
    "Ontario Insurance Act",
    "Ontario Consumer Protection Act",
    "CCIR Fair Treatment"
  ],
  "risk_level": "high",
  "tags": [
    "fsra",
    "ontario",
    "consumer-protection",
    "insurance",
    "complaints",
    "fair-treatment"
  ],
  "related_templates": [
    "amf-quebec-financial-oversight",
    "pipeda-consent-principles",
    "soc2-access-control"
  ],
  "conditions_analysis": {
    "total_conditions": 6,
    "user_attributes": 0,
    "resource_attributes": 2,
    "context_attributes": 4
  },
  "integration_guide": {
    "overview": "Integrate with insurance admin systems, CRM, and complaint tracking platforms",
    "steps_by_system": []
  }
}